;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;
(define x 10)
(parallel-execute (lambda () (set! x (* x x)))    ;; a
                  (lambda () (set! x (* x x x)))) ;; b

;; a: a1,a2,a3 分别是读两次，写一次
;; b: b1,b2,b3,b4 分别是读三次，写一次
;; 那么有 7！/(3!*4!)= 35 种可能....
;; 下面列出读和写分开的 6 种。读之间暂时不管。。。
;; a1->a2->b1->b2 ==> x: 10->100->1000000
;; a1->b1->a2->b2 ==> x: 10->10->100->1000
;; a1->b1->b2->a2 ==> x: 10->10->1000->100
;; b1->a1->a2->b2 ==> x: 10->10->100->1000
;; b1->a1->b2->a2 ==> x: 10->10->1000->100
;; b1->b2->a1->a2 ==> x: 10->1000->1000->1000000
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;;;;;;;;;;;;;;;
(define x 10)
(define s (make-serializer))
(parallel-execute (s (lambda () (set! x (* x x))))
                  (s (lambda () (set! x (* x x x)))))

;; 去掉了 6 种组合中的交错部分即 2 3 4 5, 最终结果为 1000000
